//666
var a = [2,3,4,5,6,7],d=[7,6,5,4,3,2],n = 5;
for (var i = 0; i < n; i++) {
   // a[i] = Math.random() * (11);
  //  a[i] = Math.floor(a[i]);
    alert(a[i] + ' ');
}
alert(' ');
for (var i = 0; i < n; i++) {
   // d[i] = Math.random() * (11);
   // d[i] = Math.floor(d[i]);
    alert(d[i] + ' ');
}
alert(d[5]+'(x-'+a[0]+')(x-'+a[1]+')(x-'+a[2]+')(x-'+a[3]+')(x-'+a[4]+')+'+d[4]+'(x-'+a[0]+')(x-'+a[1]+')(x-'+a[2]+')(x-'+a[3]+')+'+d[3]+'(x-'+a[0]+')(x-'+a[1]+')(x-'+a[2]+')+'+d[2]+'(x-'+a[0]+')(x-'+a[1]+')+'+d[1]+'(x-'+a[0]+')+'+d[0]);//дописать многочлен
